Extra_tutorials/of9_pimpleDyMFoam_vortexShedding/freeVibration/0/motionScale
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       pointScalarField;
    location    "0";
    object      motionScale;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
9790
(
1
1
1
1
1
1
1
1
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
    }
    outlet
    {
        type            calculated;
    }
    topAndBottom
    {
        type            calculated;
    }
    cylinder
    {
        type            calculated;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
