Extra_tutorials/of9_pimpleDyMFoam_vortexShedding/freeVibration/0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       pointVectorField;
    location    "0";
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            uniformFixedValue;
        value           uniform (0 0 0);
        uniformValue    
        {
            type            constant;
            value           (0 0 0);
        }
    }
    outlet
    {
        type            uniformFixedValue;
        value           uniform (0 0 0);
        uniformValue    
        {
            type            constant;
            value           (0 0 0);
        }
    }
    topAndBottom
    {
        type            uniformFixedValue;
        value           uniform (0 0 0);
        uniformValue    
        {
            type            constant;
            value           (0 0 0);
        }
    }
    cylinder
    {
        type            calculated;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
