Extra_tutorials/of9_pimpleDyMFoam_vortexShedding/freeVibration/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        action  new;
        type    cellSet;
        name    c0;
        source  boxToCell;
        sourceInfo
        {
            box (-1 -3 -1000) (1000 3 1); // Edit box bounds as required
        }
    }
);

// ************************************************************************* //
